app/controllers/diaries_controller.rb

  def index
    @diaries = Diary.all
---
SELECT "diaries".* FROM "diaries"

  def create
    @diary = Diary.new(diary_params)
    respond_to do |format|
      if @diary.save
---
INSERT INTO "diaries" ("title", "subtitle", "pages", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfsdf"], ["subtitle", ""], ["pages", ""], ["created_at", "2018-10-25 08:18:59.211580"], ["updated_at", "2018-10-25 08:18:59.211580"]]

  def update
    respond_to do |format|
      if @diary.update(diary_params)
---
UPDATE "diaries" SET "id" = $1, "updated_at" = $2 WHERE "diaries"."id" = $3  [["id", 139], ["updated_at", "2018-10-25 08:45:15.742926"], ["id", 1]]

    def set_diary
      @diary = Diary.find(params[:id])
---
SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = $1 LIMIT $2  [["id", 138], ["LIMIT", 1]]